week4/app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params) #article_params is easy to create new objects
    @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "3rd attempt"], ["body", "asdf"], ["created_at", "2016-04-14 05:33:09.248470"], ["updated_at", "2016-04-14 05:33:09.248470"]]

  def destroy
    @delete_article = Article.find(params[:id])
    @delete_article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 8]]