week4/app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
<% if logged_in? %>
  <h3>Comments (<%= @article.comments.size %>)</h3>